# identity-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/identity_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=3d9jrs6rn2]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-identity_api]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-e3af79c1-9402-412f-898b-d6fa5da4ba9b]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=d8b08ed4-dd25-4145-b375-bee8fbf40807:identity_api]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/identity_api]
module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default: Refreshing state... [id=identity_api_endpoint]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-identity_api-20230514084531587500000001]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=1f0c10121580a1420eb892a74daadabd27034fa4]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=identity_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=l3vkys3]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=272hma3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "identity_api"
      ~ last_modified                  = "2023-05-14T08:45:50.476+0000" -> (known after apply)
      ~ source_code_hash               = "9RdBnjlyrOlRgkVTKaOIHb/NFmQzJeU9XTRnUpOlBOE=" -> "K1QzldrcOLcV1ym+HPC83bOs4N9W/TqsaAhsSUwvnU4="
        tags                           = {
            "domain"        = "identity"
            "environment"   = "production"
            "resource"      = "identity-api"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "identity_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "d8b08ed4-dd25-4145-b375-bee8fbf40807:identity_api"
        name       = "identity_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "a691567a-2f5e-474b-a12a-a0f58384ba4a" -> "88d6ba22-c8a2-4d5c-be18-61778ecb7351"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*